{
    "title": "นโยบายความเป็นส่วนตัว",
    "last_updated": "อัปเดตล่าสุด: {{date}}",
    "sections": [
        {
            "id": "introduction",
            "title": "1. บทนำ",
            "paragraphs": [
                "ยินดีต้อนรับสู่ {{websiteName}} ("เว็บไซต์") นโยบายความเป็นส่วนตัวนี้อธิบายถึงวิธีการที่เรารวบรวม ใช้ เปิดเผย และปกป้องข้อมูลของคุณเมื่อคุณเยี่ยมชมเว็บไซต์ของเรา รวมถึงรูปแบบสื่อ ช่องทางสื่อ เว็บไซต์บนมือถือ หรือแอปพลิเคชันบนมือถืออื่นใดที่เกี่ยวข้องหรือเชื่อมต่อกับเว็บไซต์ (รวมเรียกว่า "ไซต์") โปรดอ่านนโยบายความเป็นส่วนตัวนี้อย่างละเอียด หากคุณไม่เห็นด้วยกับข้อกำหนดของนโยบายความเป็นส่วนตัวนี้ โปรดอย่าเข้าถึงไซต์",
                "เราขอสงวนสิทธิ์ในการเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ได้ตลอดเวลาและด้วยเหตุผลใดก็ตาม เราจะแจ้งให้คุณทราบเกี่ยวกับการเปลี่ยนแปลงใดๆ โดยการอัปเดตวันที่ "อัปเดตล่าสุด" ของนโยบายความเป็นส่วนตัวนี้ คุณควรตรวจสอบนโยบายความเป็นส่วนตัวนี้เป็นระยะเพื่อรับทราบข้อมูลอัปเดต คุณจะถือว่ารับทราบ จะอยู่ภายใต้ และจะถือว่ายอมรับการเปลี่ยนแปลงในนโยบายความเป็นส่วนตัวที่แก้ไขแล้วโดยการใช้งานไซต์อย่างต่อเนื่องหลังจากวันที่นโยบายความเป็นส่วนตัวที่แก้ไขแล้วถูกโพสต์"
            ]
        },
        {
            "id": "data-we-collect",
            "title": "2. ข้อมูลที่เรารวบรวม",
            "paragraphs": [
                "เราอาจรวบรวมข้อมูลเกี่ยวกับคุณได้หลายวิธี ข้อมูลที่เราอาจรวบรวมบนไซต์ประกอบด้วย:"
            ],
            "subsections": [
                {
                    "title": "ข้อมูลการวิเคราะห์ (Cloudflare Metrics)",
                    "paragraph": "เราใช้ Cloudflare Web Analytics เพื่อรวบรวมข้อมูลการใช้งานที่ไม่ระบุชื่อเกี่ยวกับการเยี่ยมชมเว็บไซต์ของเรา ซึ่งช่วยให้เราเข้าใจว่าผู้เยี่ยมชมโต้ตอบกับไซต์ของเราอย่างไร หน้าใดได้รับความนิยม และเราจะปรับปรุงประสบการณ์ผู้ใช้ได้อย่างไร Cloudflare Web Analytics ไม่ใช้คุกกี้หรือติดตามผู้ใช้แต่ละราย โดยจะรวบรวมข้อมูล เช่น หน้าที่คุณเยี่ยมชม เวลาที่ใช้ในหน้าเหล่านั้น และตำแหน่งทางภูมิศาสตร์ทั่วไปของที่อยู่ IP ของคุณ (โดยไม่เก็บที่อยู่ IP เต็มรูปแบบ)"
                },
                {
                    "title": "คุกกี้และเทคโนโลยีการติดตาม",
                    "paragraph": "เราใช้คุกกี้ที่จำเป็นเพื่อให้แน่ใจว่าเว็บไซต์ของเราทำงานได้อย่างถูกต้อง คุกกี้เหล่านี้จำเป็นอย่างยิ่งสำหรับการทำงานของเว็บไซต์และไม่สามารถปิดได้ในระบบของเรา โดยปกติแล้วจะตั้งค่าเพื่อตอบสนองต่อการกระทำที่คุณทำซึ่งเท่ากับการร้องขอบริการ เช่น การตั้งค่าความเป็นส่วนตัว การเข้าสู่ระบบ หรือการกรอกแบบฟอร์ม คุณสามารถตั้งค่าเบราว์เซอร์ของคุณให้บล็อกหรือแจ้งเตือนคุณเกี่ยวกับคุกกี้เหล่านี้ได้ แต่บางส่วนของไซต์จะไม่ทำงาน",
                    "additional_paragraph": "ขณะนี้เราไม่ได้ใช้คุกกี้ที่ไม่จำเป็นสำหรับการโฆษณาหรือวัตถุประสงค์ในการติดตามที่กว้างขวาง หากมีการเปลี่ยนแปลงในอนาคต เราจะอัปเดตนโยบายนี้และจัดให้มีกลไกการยินยอมที่เหมาะสม"
                },
                {
                    "title": "ข้อมูลส่วนบุคคล (ถ้ามี)",
                    "paragraph": "ในฐานะเว็บไซต์พอร์ตโฟลิโอ บล็อก และแกลเลอรีศิลปะ โดยทั่วไปเราจะไม่รวบรวมข้อมูลส่วนบุคคลเว้นแต่คุณจะให้ข้อมูลแก่เราโดยสมัครใจ เช่น การติดต่อเราผ่านแบบฟอร์มอีเมลหรือการสมัครรับจดหมายข่าว (ถ้ามี) หากคุณเลือกที่จะให้ข้อมูลส่วนบุคคล อาจรวมถึงชื่อ ที่อยู่อีเมล และข้อมูลอื่นใดที่คุณเลือกที่จะให้ เราจะใช้ข้อมูลนี้เพื่อวัตถุประสงค์ที่ให้ไว้เท่านั้น"
                }
            ]
        },
        {
            "id": "how-we-use-your-information",
            "title": "3. วิธีการใช้ข้อมูลของคุณ",
            "paragraphs": [
                "การมีข้อมูลที่ถูกต้องเกี่ยวกับคุณช่วยให้เราสามารถมอบประสบการณ์ที่ราบรื่น มีประสิทธิภาพ และปรับแต่งได้ให้แก่คุณ โดยเฉพาะอย่างยิ่ง เราอาจใช้ข้อมูลที่รวบรวมเกี่ยวกับคุณผ่านไซต์เพื่อ:"
            ],
            "list_items": [
                "ตรวจสอบและวิเคราะห์การใช้งานและแนวโน้มเพื่อปรับปรุงประสบการณ์ของคุณกับไซต์",
                "ปรับปรุงประสิทธิภาพและการทำงานของไซต์",
                "ตอบคำถามหรือคำขอของคุณหากคุณติดต่อเรา",
                "ดำเนินกิจกรรมทางธุรกิจอื่นๆ ตามความจำเป็น"
            ]
        },
        {
            "id": "disclosure-of-your-information",
            "title": "4. การเปิดเผยข้อมูลของคุณ",
            "paragraphs": [
                "เราจะไม่ขาย แลกเปลี่ยน ให้เช่า หรือแบ่งปันข้อมูลส่วนบุคคลของคุณกับบุคคลที่สามโดยไม่ได้รับความยินยอมจากคุณ ยกเว้นตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้",
                "เราอาจเปิดเผยข้อมูลที่เราได้รวบรวมเกี่ยวกับคุณในบางสถานการณ์:"
            ],
            "subsections": [
                {
                    "title": "ตามกฎหมายหรือเพื่อปกป้องสิทธิ์",
                    "paragraph": "หากเราเชื่อว่าการเปิดเผยข้อมูลเกี่ยวกับคุณจำเป็นเพื่อตอบสนองต่อกระบวนการทางกฎหมาย เพื่อตรวจสอบหรือแก้ไขการละเมิดนโยบายของเรา หรือเพื่อปกป้องสิทธิ์ ทรัพย์สิน และความปลอดภัยของผู้อื่น เราอาจแบ่งปันข้อมูลของคุณตามที่กฎหมาย กฎ หรือข้อบังคับที่เกี่ยวข้องอนุญาตหรือกำหนด"
                },
                {
                    "title": "ผู้ให้บริการบุคคลที่สาม",
                    "paragraph": "เราอาจแบ่งปันข้อมูลของคุณกับบุคคลที่สามที่ให้บริการแก่เราหรือในนามของเรา รวมถึงการวิเคราะห์ข้อมูล การส่งอีเมล บริการโฮสติ้ง และความช่วยเหลือด้านการตลาด ตัวอย่างเช่น Cloudflare ประมวลผลข้อมูลการวิเคราะห์ในนามของเราตามที่อธิบายไว้ข้างต้น"
                }
            ]
        },
        {
            "id": "security-of-your-information",
            "title": "5. ความปลอดภัยของข้อมูลของคุณ",
            "paragraphs": [
                "เราใช้มาตรการรักษาความปลอดภัยด้านการบริหาร เทคนิค และทางกายภาพเพื่อช่วยปกป้องข้อมูลส่วนบุคคลของคุณ แม้ว่าเราจะใช้มาตรการที่สมเหตุสมผลเพื่อรักษาความปลอดภัยของข้อมูลส่วนบุคคลที่คุณให้ไว้กับเรา โปรดทราบว่าแม้จะมีความพยายามของเรา แต่ไม่มีมาตรการรักษาความปลอดภัยใดที่สมบูรณ์แบบหรือไม่มีช่องโหว่ และไม่มีวิธีการส่งข้อมูลใดที่สามารถรับประกันได้ว่าจะไม่มีการดักจับหรือการใช้ในทางที่ผิดประเภทอื่นใด"
            ]
        },
        {
            "id": "your-rights",
            "title": "6. สิทธิ์ของคุณ (เช่น GDPR, CCPA)",
            "paragraphs": [
                "ขึ้นอยู่กับตำแหน่งของคุณ คุณอาจมีสิทธิ์บางประการเกี่ยวกับข้อมูลส่วนบุคคลของคุณ รวมถึง:"
            ],
            "list_items": [
                "สิทธิ์ในการเข้าถึงข้อมูลส่วนบุคคลของคุณ",
                "สิทธิ์ในการขอแก้ไขข้อมูลส่วนบุคคลที่ไม่ถูกต้อง",
                "สิทธิ์ในการขอให้ลบข้อมูลส่วนบุคคลของคุณ",
                "สิทธิ์ในการคัดค้านการประมวลผลข้อมูลส่วนบุคคลของคุณ",
                "สิทธิ์ในการขอจำกัดการประมวลผลข้อมูลส่วนบุคคลของคุณ",
                "สิทธิ์ในการถ่ายโอนข้อมูล",
                "สิทธิ์ในการถอนความยินยอม (ถ้ามี)"
            ],
            "additional_paragraph": "หากต้องการใช้สิทธิ์เหล่านี้ โปรดติดต่อเราโดยใช้ข้อมูลติดต่อที่ให้ไว้ด้านล่าง"
        },
        {
            "id": "contact-us",
            "title": "7. ติดต่อเรา",
            "paragraphs": [
                "หากคุณมีคำถามหรือความคิดเห็นเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ โปรดติดต่อเราที่:"
            ]
        }
    ],
    "table_of_contents_title": "สารบัญ"
}