{
    "title": "ข้อกำหนดในการให้บริการ",
    "last_updated": "อัปเดตล่าสุด: {{date}}",
    "sections": [
        {
            "id": "introduction",
            "title": "1. บทนำ",
            "paragraphs": [
                "ยินดีต้อนรับสู่ {{websiteName}} (\"เว็บไซต์\") ข้อกำหนดในการให้บริการ (\"ข้อกำหนด\") เหล่านี้ควบคุมการเข้าถึงและการใช้งานเว็บไซต์และเนื้อหา คุณลักษณะ และบริการ (รวมเรียกว่า \"บริการ\") โดยการเข้าถึงหรือใช้บริการ คุณตกลงที่จะผูกพันตามข้อกำหนดเหล่านี้และนโยบายความเป็นส่วนตัวของเรา หากคุณไม่เห็นด้วยกับข้อกำหนดเหล่านี้ โปรดอย่าใช้บริการ"
            ]
        },
        {
            "id": "acceptance-of-terms",
            "title": "2. การยอมรับข้อกำหนด",
            "paragraphs": [
                "โดยการใช้บริการของเรา คุณยืนยันว่าคุณมีอายุอย่างน้อย 18 ปีหรือบรรลุนิติภาวะในเขตอำนาจศาลของคุณ และคุณมีความสามารถทางกฎหมายในการทำข้อตกลงที่มีผลผูกพัน หากคุณใช้บริการในนามของนิติบุคคล คุณรับรองว่าคุณมีอำนาจในการผูกพันนิติบุคคลนั้นตามข้อกำหนดเหล่านี้"
            ]
        },
        {
            "id": "changes-to-terms",
            "title": "3. การเปลี่ยนแปลงข้อกำหนด",
            "paragraphs": [
                "เราขอสงวนสิทธิ์ในการแก้ไขหรืออัปเดตข้อกำหนดเหล่านี้ได้ตลอดเวลา ตามดุลยพินิจของเราแต่เพียงผู้เดียว เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใดๆ โดยการโพสต์ข้อกำหนดใหม่ในหน้านี้และอัปเดตวันที่ \"อัปเดตล่าสุด\" การใช้งานบริการของคุณอย่างต่อเนื่องหลังจากมีการเปลี่ยนแปลงดังกล่าวถือเป็นการยอมรับข้อกำหนดใหม่ของคุณ เป็นความรับผิดชอบของคุณในการตรวจสอบข้อกำหนดเหล่านี้เป็นระยะเพื่อดูการเปลี่ยนแปลง"
            ]
        },
        {
            "id": "user-obligations",
            "title": "4. ภาระผูกพันของผู้ใช้",
            "paragraphs": [
                "ในฐานะผู้ใช้บริการ คุณตกลงที่จะไม่:"
            ],
            "list_items": [
                "ใช้บริการเพื่อวัตถุประสงค์ที่ผิดกฎหมายหรือในลักษณะใดๆ ที่ละเมิดข้อกำหนดเหล่านี้",
                "ละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของเราหรือสิทธิ์ในทรัพย์สินทางปัญญาของผู้อื่น",
                "อัปโหลดหรือส่งไวรัสหรือรหัสที่เป็นอันตรายประเภทอื่นใด",
                "คุกคาม, ดูหมิ่น, ดูถูก, ทำร้าย, หมิ่นประมาท, ใส่ร้าย, ดูถูก, ข่มขู่, หรือเลือกปฏิบัติบนพื้นฐานของเพศ, รสนิยมทางเพศ, ศาสนา, ชาติพันธุ์, เชื้อชาติ, อายุ, ถิ่นกำเนิด, หรือความพิการ",
                "รวบรวมหรือติดตามข้อมูลส่วนบุคคลของผู้อื่น",
                "สแปม, ฟิช, ฟาร์ม, แอบอ้าง, สไปเดอร์, คลาน, หรือขูดข้อมูล",
                "แทรกแซงหรือหลีกเลี่ยงคุณสมบัติความปลอดภัยของบริการ"
            ]
        },
        {
            "id": "intellectual-property",
            "title": "5. สิทธิ์ในทรัพย์สินทางปัญญา",
            "paragraphs": [
                "เนื้อหาทั้งหมดบนเว็บไซต์ รวมถึงข้อความ กราฟิก โลโก้ รูปภาพ และซอฟต์แวร์ เป็นทรัพย์สินของเราหรือทรัพย์สินของผู้ให้อนุญาตของเรา และได้รับการคุ้มครองโดยลิขสิทธิ์และกฎหมายทรัพย์สินทางปัญญาอื่นๆ คุณไม่สามารถทำซ้ำ แจกจ่าย แก้ไข สร้างงานลอกเลียนแบบ แสดงต่อสาธารณะ ดำเนินการต่อสาธารณะ เผยแพร่ซ้ำ ดาวน์โหลด จัดเก็บ หรือส่งเนื้อหาใดๆ ของบริการของเรา ยกเว้นตามที่บริการอนุญาตโดยทั่วไป"
            ]
        },
        {
            "id": "disclaimer-of-warranties",
            "title": "6. ข้อจำกัดความรับผิดชอบในการรับประกัน",
            "paragraphs": [
                "บริการนี้มีให้ในลักษณะ \"ตามสภาพ\" และ \"ตามที่มี\" โดยไม่มีการรับประกันใดๆ ไม่ว่าโดยชัดแจ้งหรือโดยนัย เราไม่รับประกันว่าบริการจะไม่มีการหยุดชะงัก ปลอดภัย หรือปราศจากข้อผิดพลาด เราปฏิเสธการรับประกันทั้งหมด รวมถึงแต่ไม่จำกัดเพียงการรับประกันความสามารถในการซื้อขาย การไม่ละเมิด และความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ"
            ]
        },
        {
            "id": "limitation-of-liability",
            "title": "7. ข้อจำกัดความรับผิด",
            "paragraphs": [
                "ไม่ว่าในกรณีใด เราจะไม่รับผิดชอบต่อความเสียหายทางอ้อม โดยบังเอิญ พิเศษ เป็นผลสืบเนื่อง หรือเชิงลงโทษ รวมถึงแต่ไม่จำกัดเพียงการสูญเสียผลกำไร ข้อมูล การใช้งาน ชื่อเสียง หรือการสูญเสียที่จับต้องไม่ได้อื่นๆ ที่เกิดจาก (I) การเข้าถึงหรือการใช้หรือไม่สามารถเข้าถึงหรือใช้บริการของคุณ; (II) การกระทำหรือเนื้อหาใดๆ ของบุคคลที่สามในบริการ; (III) เนื้อหาใดๆ ที่ได้รับจากบริการ; และ (IV) การเข้าถึง การใช้ หรือการเปลี่ยนแปลงการส่งหรือเนื้อหาของคุณโดยไม่ได้รับอนุญาต ไม่ว่าจะอยู่บนพื้นฐานของการรับประกัน สัญญา การละเมิด (รวมถึงความประมาท) หรือทฤษฎีทางกฎหมายอื่นใด ไม่ว่าเราจะได้รับแจ้งถึงความเป็นไปได้ของความเสียหายดังกล่าวหรือไม่ และแม้ว่าการเยียวยาที่ระบุไว้ในที่นี้จะพบว่าล้มเหลวในวัตถุประสงค์ที่สำคัญ"
            ]
        },
        {
            "id": "indemnification",
            "title": "8. การชดใช้ค่าเสียหาย",
            "paragraphs": [
                "คุณตกลงที่จะปกป้อง ชดใช้ค่าเสียหาย และทำให้ [ชื่อเว็บไซต์ของคุณ] และบริษัทในเครือ ผู้ให้อนุญาต และผู้ให้บริการ และเจ้าหน้าที่ ผู้อำนวยการ พนักงาน ผู้รับเหมา ตัวแทน ผู้ให้อนุญาต ซัพพลายเออร์ ผู้สืบทอด และผู้รับโอนของบริษัทและของพวกเขา พ้นจากและต่อการเรียกร้อง ความรับผิด ความเสียหาย การตัดสิน รางวัล การสูญเสีย ค่าใช้จ่าย หรือค่าธรรมเนียม (รวมถึงค่าทนายความที่สมเหตุสมผล) ที่เกิดขึ้นจากหรือเกี่ยวข้องกับการละเมิดข้อกำหนดเหล่านี้ของคุณหรือการใช้บริการของคุณ"
            ]
        },
        {
            "id": "governing-law",
            "title": "9. กฎหมายที่ใช้บังคับ",
            "paragraphs": [
                "ข้อกำหนดเหล่านี้จะถูกควบคุมและตีความตามกฎหมายของ [ประเทศ/รัฐของคุณ] โดยไม่คำนึงถึงข้อขัดแย้งของบทบัญญัติกฎหมาย"
            ]
        },
        {
            "id": "contact-us",
            "title": "10. ติดต่อเรา",
            "paragraphs": [
                "หากคุณมีคำถามใดๆ เกี่ยวกับข้อกำหนดเหล่านี้ โปรดติดต่อเราที่:"
            ]
        }
    ],
    "table_of_contents_title": "สารบัญ"
}